Revit 2027 API
SubTransaction.RollBack Method
 Discards all changes made to the model during the sub-transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus RollBack()
Public Function RollBack As TransactionStatus
public:
TransactionStatus RollBack()
member RollBack : unit -> TransactionStatus
Return Value
TransactionStatus
 If finished successfully, this method returns TransactionStatus.RolledBack.
Exceptions
Exception | Condition
InvalidOperationException |  A sub-transaction can only be active inside an open Transaction. -or- The sub-transaction's current status is not TransactionStatus.Started, therefore it may not be committed or rolled back.
Remarks
The parent transaction (or a parent sub-transaction, if any) can still be committed, but the changes rolled back by this method will not be part of the committed transaction.
RollBack can be called only when all inner sub-transaction, if any, are finished, i.e. they were either committed or rolled back. If there is still a sub-transaction open, an attempt to roll this outer sub-transaction back will cause an exception.
See Also
Reference
SubTransaction Class
Autodesk.Revit.DB Namespace